import pandas as pd
import numpy as np

#Словник
phones = {
    "380681234567": "Мельник",
    "380698901111": "Шевченко",
    "380961112233": "Коваленко",
    "380974445566": "Бондаренко",
    "380987778899": "Бойко",
    "380990007777": "Ткаченко",
    "380662224455": "Кравченко",
    "380681234000": "Ковальчук",
    "380983456789": "Коваль",
    "380963333222": "Олійник"
}
#Вік користувачів
ages = [15, 20, 11, 39, 27, 33, 19, 26, 35, 20]
#Тарифи
tariffs = [225, 250, 300, 200, 350, 400, 180, 260, 230, 170]

# Кількість місяців користування для прикладу
months = [12, 6, 3, 4, 4, 12, 6, 1, 2, 1]

# Створення DataFrame
df = pd.DataFrame({
    "phone": list(phones.keys()),
    "Name": list(phones.values()),
    "Age": ages,
    "Tariff": tariffs,
    "Months": months
})

# Розрахунок загальної вартості
df["Total"] = df["Tariff"] * df["Months"]

# Виведення DataFrame
print("Початкові дані")
print(df)

#Перші 3 рядки
print("\nПерші 3 записи")
print(df.head(3))

#Типи даних
print("\nТипи даних")
print(df.dtypes)

#Розмір таблиці
print("\nРозмір DataFrame (рядки, стовпці)")
print(df.shape)

#Описова статистика
print("\nОписова статистика")
print(df.describe())

# Фільтрація тарифів > 250 грн
print("\nКористувачі з тарифом > 250 грн")
print(df[df["Tariff"] > 250])

#Сортування за спаданням тарифу
print("\nСортування за тарифом (спадання)")
print(df.sort_values(by="Tariff", ascending=False))

#Середній тариф
print("\nСередній тариф")
print(df["Tariff"].mean())

#Максимальна загальна сума оплати
print("\nМаксимальна сума оплати")
print(df["Total"].max())

#Кількість унікальних прізвищ
print("\nКількість унікальних користувачів")
print(df["Name"].nunique())