import matplotlib.pyplot as plt

# Дані з таблиці (GDP per capita, США)
years = [
    1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000,
    2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010,
    2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019
]

values = [
    24342.26, 25418.99, 26387.29, 27694.85, 28690.88, 29967.71, 31459.13,
    32853.67, 34515.38, 36329.97, 37133.62, 37997.74, 39490.30, 41724.64,
    44123.40, 46301.99, 48050.23, 48570.06, 47194.95, 48642.63, 50024.88,
    51708.39, 53297.39, 55153.39, 56849.47, 57976.63, 60047.72, 62875.67, 65227.96
]
#Округлимо значення до десятих
values = [round(v, 1) for v in values]

#Щоб діаграма не була перевантажена, виберемо дані по кожних 5 років
years_short = years[::5]
values_short = values[::5]

#Побудова кругової діаграми
plt.figure(figsize=(8, 8))
plt.pie(
    values_short,
    labels=years_short,
    autopct='%1.1f%%',  # відображення відсотків з одним десятковим
    startangle=90,
    colors=plt.cm.tab20.colors#різні кольори секторів
)
plt.title('GDP per capita (current US$) — United States (1991–2019) in 5 years', fontsize=14)
plt.show()
